ELPasEDT/src/InformationRegisters/ПоследовательностьВводаОперацийРаботыХимцеха/ПоследовательностьВводаОперацийРаботыХимцеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследовательностьВводаОперацийРаботыХимцеха</name>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииОборудованияХимцеха</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СвязаннаяОперацияДокумент</name>
    <type>
      <types>DocumentRef.ЗаписьЖурналаУчетаРеагентов</types>
      <types>DocumentRef.РасходРеагента</types>
    </type>
  </resources>
  <resources>
    <name>СвязаннаяОперацияНомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаписьЖурналаУчетаРеагентов</types>
      <types>DocumentRef.РасходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Enums/ОперацииОборудованияХимцеха/ОперацииОборудованияХимцеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииОборудованияХимцеха</name>
  <enumValues>
    <name>ВключениеЗакачки</name>
  </enumValues>
  <enumValues>
    <name>ВыключениеЗакачуи</name>
  </enumValues>
  <enumValues>
    <name>ВключениеРасхода</name>
  </enumValues>
  <enumValues>
    <name>ВыключениеРасхода</name>
  </enumValues>
  <enumValues>
    <name>ВыключениеРасходаОдновременноСЗакачкой</name>
  </enumValues>
  <enumValues>
    <name>ВыключениеЗакачкиОдновременноСРасходом</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/ЗаписьЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурналаУчетаРеагентов</name>
  <registerRecords>InformationRegister.РаботаХимцеха</registerRecords>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <registerRecords>InformationRegister.УровеньРаствораВМернике</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияПоДокументам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораЗакачка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлотностьПоТаблицам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходТоварногоРеагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаНачата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитатьРасходВоВремяЗакачки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистойЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистогоРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАвтрораИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировки</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/ПоследовательностьВводаОперацийРаботыХимцеха/ManagerModule.bsl
Функция ПолучитьНовыйНомерОперации(ДокСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПоследовательностьВводаОперацийРаботыХимцеха.НомерОперации) КАК НомерОперации
	|ИЗ
	|	РегистрСведений.ПоследовательностьВводаОперацийРаботыХимцеха КАК ПоследовательностьВводаОперацийРаботыХимцеха
	|ГДЕ
	|	ПоследовательностьВводаОперацийРаботыХимцеха.Документ = &Документ");
	Запрос.УстановитьПараметр("Документ", ДокСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ?(Выборка.НомерОперации = Null, 1, Выборка.НомерОперации + 1);
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

Процедура ОтменитьОперациюУдалитьЗапись(Документ, НомерОперации, ДокументыОпераций)
	
	ЗаписьОперация = РегистрыСведений.ПоследовательностьВводаОперацийРаботыХимцеха.СоздатьМенеджерЗаписи();
	ЗаписьОперация.Документ = Документ;
	ЗаписьОперация.НомерОперации = НомерОперации;
	ЗаписьОперация.Прочитать();
	
	ДокОбъект = ДокументыОпераций.Получить(Документ);
	Если ДокОбъект = Неопределено Тогда
		ДокОбъект = Документ.ПолучитьОбъект();
		ДокументыОпераций.Вставить(Документ, ДокОбъект);
	КонецЕсли;
	
	ОчиститьЗначенияРеквизитов(ДокОбъект, ЗаписьОперация.Операция);
	
	Если ЗначениеЗаполнено(ЗаписьОперация.СвязаннаяОперацияДокумент) Тогда
		ОтменитьОперациюУдалитьЗапись(ЗаписьОперация.СвязаннаяОперацияДокумент, ЗаписьОперация.СвязаннаяОперацияНомерОперации, ДокументыОпераций)
	КонецЕсли;
	
	ЗаписьОперация.Удалить();
	
КонецПроцедуры

Процедура ОтменитьОперацию(ВидРеагента, Смена = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоследовательностьВводаОперацийРаботыХимцеха.Документ КАК Документ,
	|	ПоследовательностьВводаОперацийРаботыХимцеха.НомерОперации КАК НомерОперации,
	|	ПоследовательностьВводаОперацийРаботыХимцеха.ДокументПриемаСмены КАК ДокументПриемаСмены
	|ИЗ
	|	РегистрСведений.ПоследовательностьВводаОперацийРаботыХимцеха КАК ПоследовательностьВводаОперацийРаботыХимцеха
	|ГДЕ
	|	ПоследовательностьВводаОперацийРаботыХимцеха.Документ.ВидРеагента = &ВидРеагента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ УБЫВ,
	|	ПоследовательностьВводаОперацийРаботыХимцеха.НомерОперации УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ВидРеагента", ВидРеагента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Смена <> Неопределено Тогда
			Если Смена <> Выборка.ДокументПриемаСмены Тогда
				Возврат
			КонецЕсли;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.РасходРеагента") Тогда
			ДокОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ЗаписьОперация = РегистрыСведений.ПоследовательностьВводаОперацийРаботыХимцеха.СоздатьМенеджерЗаписи();
			ЗаписьОперация.Документ = Выборка.Документ;
			ЗаписьОперация.НомерОперации = Выборка.НомерОперации;
			ЗаписьОперация.Удалить();
		Иначе
			
			ДокументыОпераций = Новый Соответствие;
			ОтменитьОперациюУдалитьЗапись(Выборка.Документ, Выборка.НомерОперации, ДокументыОпераций);
			
			Для Каждого Элемент Из ДокументыОпераций Цикл
				ЗаписатьУдалитьДокПослеОтменыОперации(Элемент.Значение);
			КонецЦикла;
			
		КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьУдалитьДокПослеОтменыОперации(ДокОбъект)
	
	Если ДокОбъект.РасходНачат
		Или ДокОбъект.РасходЗавершен
		Или ДокОбъект.ЗакачкаНачата
		Или ДокОбъект.ЗакачкаЗавершена Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьЗначенияРеквизитов(ДокОбъект, Операция)
	
	МестоВСтроке = 0;
	
	Если Операция = Перечисления.ОперацииОборудованияХимцеха.ВключениеЗакачки Тогда
		МестоВСтроке = 1;
	ИначеЕсли Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеЗакачуи
		Или Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеЗакачкиОдновременноСРасходом Тогда
		МестоВСтроке = 2;
	ИначеЕсли Операция = Перечисления.ОперацииОборудованияХимцеха.ВключениеРасхода Тогда
		МестоВСтроке = 3;
	ИначеЕсли Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеРасхода
		Или Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеРасходаОдновременноСЗакачкой Тогда
		МестоВСтроке = 4;
	КонецЕсли;
	
	ИменаПолей   = Документы.ЗаписьЖурналаУчетаРеагентов.ПолучитьИменаПолейТаблицыЖурнала(МестоВСтроке);
	
	
	Если МестоВСтроке = 2 Тогда      // Окончание закачки
		Если Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеЗакачуи Тогда
			ДокОбъект.ДатаОкончанияЧистойЗакачки = Неопределено;
		КонецЕсли;
	ИначеЕсли МестоВСтроке = 4 Тогда // Окончание расхода
		Если Операция = Перечисления.ОперацииОборудованияХимцеха.ВыключениеРасхода Тогда
			ДокОбъект.ДатаОкончанияЧистогоРасхода = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	Если МестоВСтроке = 1 Тогда
		ДокОбъект.ЗакачкаНачата = Ложь;
	ИначеЕсли МестоВСтроке = 2 Тогда
		ДокОбъект.ЗакачкаЗавершена  = Ложь;
	ИначеЕсли МестоВСтроке = 3 Тогда
		ДокОбъект.РасходНачат  = Ложь;
	ИначеЕсли МестоВСтроке = 4 Тогда
		ДокОбъект.РасходЗавершен  = Ложь;
	КонецЕсли;
	
	ДокОбъект[ИменаПолей.Дата]          = Неопределено;
	ДокОбъект[ИменаПолей.Уровень]       = Неопределено;
	ДокОбъект[ИменаПолей.Концентрация]  = Неопределено;
	ДокОбъект[ИменаПолей.Смена]         = Неопределено;
	ДокОбъект[ИменаПолей.Ответственный] = Неопределено;
	ДокОбъект[ИменаПолей.Вахта]         = Неопределено;
	ДокОбъект[ИменаПолей.Комментарий]   = Неопределено;
	
КонецПроцедуры
